app/controllers/home_controller.rb

SELECT * FROM "contacts" WHERE ("contacts"."strLastname" = 'schouppe' AND "contacts"."strFirstname" = 'matt') LIMIT 1
---
  def login
    loginid = params[:home]
    c = Contact.find_by_strFirstname_and_strLastname(loginid[:strFirstname], loginid[:strLastname])