app/controllers/login_controller.rb

SELECT * FROM "contacts" WHERE ("contacts"."id" = '--- :id
SELECT * FROM "workorders" WHERE ("workorders".contact_id = 1)
---
  def show
    @contact = Contact.find(params[:id])
    @workorders = @contact.workorders.all